#key=lambda를 이용한 정렬
b=[(0, 1), (0, 3), (1, 2), (3, 0), (5, 1), (5, 2)]

c=sorted(b, key=lambda x : x[0])
print(c) #[(0, 1), (0, 3), (1, 2), (3, 0), (5, 1), (5, 2)]
#먼저 x[0]기준으로 오름차순, x[1]은 오름차순(기본)

c=sorted(b, key=lambda x : x[1])
print(c) #[(3, 0), (0, 1), (5, 1), (1, 2), (5, 2), (0, 3)]
#먼저 x[1]기준으로 오름차순, x[0]은 오름차순(기본)

c=sorted(b, key=lambda x : (x[1],-x[0]))
print(c) #[(3, 0), (5, 1), (0, 1), (5, 2), (1, 2), (0, 3)]
#먼저 x[1]기준으로 오름차순, x[1]은 내림차순

c=sorted(b, key=lambda x : (-x[1],x[0]))
print(c) #[(0, 3), (1, 2), (5, 2), (0, 1), (5, 1), (3, 0)]
#먼저 x[1]기준으로 내림차순, x[0]은 오름차순

#-를 붙이면, 현재 정렬차순과 반대로 하게 된다.
